chistory = {
  
  

-202:"推漢高五年，太一在四宮，主人與客俱得吉，計先舉事者勝，是歲高祖破楚。《南齊書 ‧ 高帝紀》",
213:"亮算太乙數，今年歲次癸巳，罡星在西方；又觀乾象，太白臨於洛城之分，主於將帥，多凶少吉。《諸葛亮集 ‧ 高上先帝書》",
265:"泰始元年，太一在二宮，為大小將奄擊之，其年景和廢。《南齊書 ‧ 高帝紀》",
266:"泰始二年，太一在三宮，不利先起，主人勝，其年晉安王子勛反。《南齊書 ‧ 高帝紀》"
403:"元興二年，太一在七宮，太一為帝，天目為輔佐，迫脅太一，是年安帝為桓玄所逼出宮。大將在一宮，參相在三宮，格太一。經言格者，已立政事，上下格之，不利有為，安居之世，不利舉動。《南齊書 ‧ 高帝紀》",
404:"元興三年，太一在七宮，宋武破桓玄。《南齊書 ‧ 高帝紀》",
424:"元嘉元年，太一在六宮，不利有為，徐、傅廢營陽王。《南齊書 ‧ 高帝紀》",
430:"元嘉七年，太一在八宮，關囚惡歲，大小將皆不得立，其年到彥之北伐，初勝後敗，客主俱不利。《南齊書 ‧ 高帝紀》",
441:"元嘉十八年，太一在二宮，客主俱不利，是歲氐楊難當寇梁、益，來年仇池破。《南齊書 ‧ 高帝紀》",
441:"元嘉十九年，大小將皆見關不立，凶，其年裴方明伐仇池，剋百頃，明年失之。《南齊書 ‧ 高帝紀》",
474:"元徽二年，太一在六宮，先起敗，是歲桂陽王休範反，竝伏誅。《南齊書 ‧ 高帝紀》",
476:"元徽四年，太一在七宮，先起者客，西北走，其年建平王景素敗。《南齊書 ‧ 高帝紀》",
477:"昇明元年，太一在七宮，不利為客，安居之世，舉事為主人，應發為客，袁粲、沈攸之等反，伏誅。是歲太一在杜門，臨八宮，宋帝禪位，不利為客，安居之世，舉事為主人，禪代之應也。《南齊書 ‧ 高帝紀》",
604:"仁壽四年甲子歲，煬帝初即位，充及太史丞高智寶奏言：「去歲冬至，日影逾長，今歲皇帝即位，與堯受命年合。昔唐堯受命四十九年，到上元第一紀甲子，天正十一月庚戌冬至，陛下即位，其年即當上元第一紀甲子，天正十一月庚戌冬至，正與唐堯同。自放勳以來，凡經八上元，其間綿代，未有仁壽甲子之合。謹案：第一紀甲子，太一在一宮，天目居武德，陰陽曆數並得符同。唐堯景辰生，丙子年受命，止合三五，未若己丑甲子，支干並當六合。允一元三統之期，合五紀九章之會，共帝堯同其數，與皇唐比其蹤。信所謂皇哉唐哉，唐哉皇哉者矣。」《隋書 ‧ 袁充傳》",
1282:"歲壬午，太一理艮宮，主大將客、參將囚，直符治事，正屬燕分。明年春，京城當有盜兵，事干將相。十九年三月，盜果起京師，殺阿合馬等。帝欲徵日本，命康以太一推之，康奏曰：「南國甫定，民力未蘇，且今年太一無算，舉兵不利。」從之。嘗賜太史院錢，分千貫以與康，不受，眾服其廉。《元史 ‧ 張康傳》",
 

}
