chistory = {
  
  
-206:"《漢書 ‧ 天文志》漢高祖元年十月，五星聚於東井，以曆推之，從歲星也。此高皇帝受命之符也。故客謂張耳曰：「東并秦地，漢王入秦，五星從歲星聚，當以義取天下。」秦王子嬰降於枳道，漢王以屬吏，寶器婦女亡所取，閉宮封門，還軍次于霸上，以候諸侯。與秦民約法三章，民亡不歸心者，可謂能行義矣，天之所予也。五年遂定天下，即帝位。此明歲星之崇義，東井為秦之地明效也。",
-204:"《漢書 ‧ 天文志》漢高祖三年秋，太白出西方，有光幾中，乍北乍南，過期乃入。辰星出四孟。是時，項羽為楚王，而漢已定三秦，與相距滎陽。太白出西方，有光幾中，是秦地戰將勝，而漢國將興也。辰星出四孟，易主之表也。",
-202:"《南齊書 ‧ 高帝紀》推漢高五年，太一在四宮，主人與客俱得吉，計先舉事者勝，是歲高祖破楚。",
-200:"《漢書 ‧ 天文志》漢高祖七年，月暈，圍參、畢七重。占曰：「畢、昴間，天街也；街北，胡也；街南，中國也。昴為匈奴，參為趙，畢為邊兵。」是歲高皇帝自將兵擊匈奴，至平城，為冒頓單于所圍，七日乃解。",
-195:"《漢書 ‧ 天文志》漢高祖十二年春，熒惑守心。四月，宮車晏駕。",
-193:"《漢書 ‧ 天文志》孝惠二年，天開東北，廣十餘丈，長二十餘丈。地動，陰有餘；天裂，陽不足：皆下盛彊將害上之變也。其後有呂氏之亂。",
  
-178:"《漢書 ‧ 天文志》孝文後二年正月壬寅，天欃夕出西南。占曰：「為兵喪亂。」",
-174:"《漢書 ‧ 天文志》孝文六年，十一月，匈奴入上郡、雲中，漢起三軍以衛京師。八月，天狗下梁野，是歲誅反者周殷長安市。其四月乙巳，水、木、火三合於東井。占曰：「外內有兵與喪，改立王公。東井，秦也。」",
-173:"《漢書 ‧ 天文志》孝文七年，其十一月戊戌，土、水合於危。占曰：「為雍沮，所當之國不可舉事用兵，必受其殃。一曰將覆軍。危，齊也。」六月，文帝崩。七月，火東行，行畢陽，環畢東北，出而西，逆行至昴，即南乃東行。占曰：「為喪死寇亂。畢、昴，趙也。」",
-156:"《漢書 ‧ 天文志》孝景元年，正月癸酉，金、水合於婺女。占曰：「為變謀，為兵憂。婺女，粵也，又為齊。」其七月乙丑，金、木、水三合於張。占曰：「外內有兵與喪，改立王公。張，周地，今之河南也，又為楚。」",
-155:"《漢書 ‧ 天文志》孝景二年，其三月，立六皇子為王，淮陽、汝南、河間、臨江、長沙、廣川。七月丙子，火與水晨出東方，因守斗。占曰：「其國絕祀。」至其十二月，水、火合於斗。占曰：「為淬，不可舉事用兵，必受其殃。」一曰：「為北軍，用兵舉事大敗。斗，吳也，又為粵。」是歲彗星出西南。",
-154:"《漢書 ‧ 天文志》孝景三年，吳、楚、膠西、膠東、淄川、濟南、趙七國反。吳、楚兵先至攻梁，膠西、膠東、淄川三國攻圍齊。漢遣大將軍周亞夫等戍止河南，以候吳楚之敝，遂敗之。吳王亡走粵，粵攻而殺之。平陽侯敗三國之師于齊，咸伏其辜，齊王自殺。漢兵以水攻趙城，城壞，王自殺。六月，立皇子二人、楚元王子一人為王，王膠西、中山、楚。徙濟北為淄川王，淮陽為魯王，汝南為江都王。七月，兵罷。天狗下，占為：「破軍殺將。狗又守禦類也，天狗所降，以戒守禦。」吳、楚攻梁，梁堅城守，遂伏尸流血其下。填星在婁，幾入，還居奎。奎，魯也。占曰：「其國得地為得填。」是歲魯為國。",
-140:"《漢書 ‧ 天文志》孝武建元三年三月，有星孛於注、張，歷太微，干紫宮，至於天漢。春秋「星孛於北斗，齊、魯、晉之君皆將死亂」。今星孛歷五宿，其後濟東、膠西、江都王皆坐法削黜自殺，淮陽、衡山謀反而誅。",
-138:"《漢書 ‧ 天文志》三年四月，有星孛於天紀，至織女。占曰：「織女有女變，天紀為地震。」",
  
  
213:"《諸葛亮集 ‧ 高上先帝書》亮算太乙數，今年歲次癸巳，罡星在西方；又觀乾象，太白臨於洛城之分，主於將帥，多凶少吉。",
265:"《南齊書 ‧ 高帝紀》泰始元年，太一在二宮，為大小將奄擊之，其年景和廢。",
266:"《南齊書 ‧ 高帝紀》泰始二年，太一在三宮，不利先起，主人勝，其年晉安王子勛反。",
403:"《南齊書 ‧ 高帝紀》元興二年，太一在七宮，太一為帝，天目為輔佐，迫脅太一，是年安帝為桓玄所逼出宮。大將在一宮，參相在三宮，格太一。經言格者，已立政事，上下格之，不利有為，安居之世，不利舉動。",
404:"《南齊書 ‧ 高帝紀》元興三年，太一在七宮，宋武破桓玄。",
424:"《南齊書 ‧ 高帝紀》元嘉元年，太一在六宮，不利有為，徐、傅廢營陽王。",
430:"《南齊書 ‧ 高帝紀》元嘉七年，太一在八宮，關囚惡歲，大小將皆不得立，其年到彥之北伐，初勝後敗，客主俱不利。",
441:"《南齊書 ‧ 高帝紀》元嘉十八年，太一在二宮，客主俱不利，是歲氐楊難當寇梁、益，來年仇池破。",
441:"《南齊書 ‧ 高帝紀》元嘉十九年，大小將皆見關不立，凶，其年裴方明伐仇池，剋百頃，明年失之。",
474:"《南齊書 ‧ 高帝紀》元徽二年，太一在六宮，先起敗，是歲桂陽王休範反，竝伏誅。",
476:"《南齊書 ‧ 高帝紀》元徽四年，太一在七宮，先起者客，西北走，其年建平王景素敗。",
477:"《南齊書 ‧ 高帝紀》昇明元年，太一在七宮，不利為客，安居之世，舉事為主人，應發為客，袁粲、沈攸之等反，伏誅。是歲太一在杜門，臨八宮，宋帝禪位，不利為客，安居之世，舉事為主人，禪代之應也。",
604:"《隋書 ‧ 袁充傳》仁壽四年甲子歲，煬帝初即位，充及太史丞高智寶奏言：「去歲冬至，日影逾長，今歲皇帝即位，與堯受命年合。昔唐堯受命四十九年，到上元第一紀甲子，天正十一月庚戌冬至，陛下即位，其年即當上元第一紀甲子，天正十一月庚戌冬至，正與唐堯同。自放勳以來，凡經八上元，其間綿代，未有仁壽甲子之合。謹案：第一紀甲子，太一在一宮，天目居武德，陰陽曆數並得符同。唐堯景辰生，丙子年受命，止合三五，未若己丑甲子，支干並當六合。允一元三統之期，合五紀九章之會，共帝堯同其數，與皇唐比其蹤。信所謂皇哉唐哉，唐哉皇哉者矣。」",
1282:"《元史 ‧ 張康傳》歲壬午，太一理艮宮，主大將客、參將囚，直符治事，正屬燕分。明年春，京城當有盜兵，事干將相。十九年三月，盜果起京師，殺阿合馬等。帝欲徵日本，命康以太一推之，康奏曰：「南國甫定，民力未蘇，且今年太一無算，舉兵不利。」從之。嘗賜太史院錢，分千貫以與康，不受，眾服其廉。《元史 ‧ 張康傳》",
 

}
